nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_adi_3_refsys.h
// Field:     [3] DAC_DBG_PRECHARGE
//
// PRE-CHARGE signal (Debug Mode)
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_PRECHARGE                    0x00000008
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_PRECHARGE_M                  0x00000008
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_PRECHARGE_S                           3

// Field:     [2] DAC_DBG_CAP_SAMPLE
//
// Cap-array sample signal (Debug Mode)
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_CAP_SAMPLE                   0x00000004
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_CAP_SAMPLE_M                 0x00000004
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_CAP_SAMPLE_S                          2

// Field:     [1] DAC_DBG_SAMPLE
//
// S-H Cap sample signal (Debug Mode)
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_SAMPLE                       0x00000002
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_SAMPLE_M                     0x00000002
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_SAMPLE_S                              1

// Field:     [0] DAC_DBG_EN
//
// Enable Debug Mode
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_EN                           0x00000001
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_EN_M                         0x00000001
#define ADI_3_REFSYS_AUX_DEBUG_DAC_DBG_EN_S                                  0

//*****************************************************************************
//
// Register: ADI_3_REFSYS_O_CTL_RECHARGE_CMP0
//
//*****************************************************************************
// Field:     [4] COMP_CLK_DISABLE
//
// Enable/Disable the 32 kHz clock (SCLK_LF)  to the recharge comparator
// ENUMs:
// DIS                      Disable the clock
// EN                       Enable the clock
#define ADI_3_REFSYS_CTL_RECHARGE_CMP0_COMP_CLK_DISABLE             0x00000010
#define ADI_3_REFSYS_CTL_RECHARGE_CMP0_COMP_CLK_DISABLE_M           0x00000010
#define ADI_3_REFSYS_CTL_RECHARGE_CMP0_COMP_CLK_DISABLE_S                    4
#define ADI_3_REFSYS_CTL_RECHARGE_CMP0_COMP_CLK_DISABLE_DIS         0x00000010
#define ADI_3_REFSYS_CTL_RECHARGE_CMP0_COMP_CLK_DISABLE_EN          0x00000000

// Field:   [3:0] TRIM_RECHARGE_COMP_REFLEVEL
//
// Trim ref level of recharge.
//
// 0xF:  90% of VDDR level.
// 0x0:  100% of VDDR level.
//
// Step size = 0.67% of VDDR level.
#define ADI_3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_W \
                                                                             4
#define ADI_3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_M \
                                                                    0x0000000F
#define ADI_3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_S \
                                                                             0

//*****************************************************************************
//
// Register: ADI_3_REFSYS_O_CTL_RECHARGE_CMP1
//
//*****************************************************************************
// Field:     [7] RECHARGE_BLOCK_VTRIG_EN
//
// Enable/Disable ATEST input to VDDR input of recharge comparator. Used for
// trimming the recharge voltage reference level
// ENUMs:
// EN                       Enable. VDDR input is connected to ATEST network
// DIS                      Disable. VDDR input is connected to VDDR itself
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_VTRIG_EN      0x00000080
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_VTRIG_EN_M     \
                                                                    0x00000080
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_VTRIG_EN_S     \
                                                                             7
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_VTRIG_EN_EN    \
                                                                    0x00000080
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_VTRIG_EN_DIS   \
                                                                    0x00000000

// Field:     [6] RECHARGE_BLOCK_ATEST_EN
//
// Enable/Disable test inputs/outputs to recharge comparator block
// ENUMs:
// EN                       Enable
// DIS                      Disable
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_ATEST_EN      0x00000040
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_ATEST_EN_M     \
                                                                    0x00000040
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_ATEST_EN_S     \
                                                                             6
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_ATEST_EN_EN    \
                                                                    0x00000040
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_ATEST_EN_DIS   \
                                                                    0x00000000

// Field:     [5] FORCE_SAMPLE_VDDR
//
// Force Sample of VDDR on cap divider
// ENUMs:
// EN                       Enable
// DIS                      Disable
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_FORCE_SAMPLE_VDDR            0x00000020
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_FORCE_SAMPLE_VDDR_M          0x00000020
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_FORCE_SAMPLE_VDDR_S                   5
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_FORCE_SAMPLE_VDDR_EN         0x00000020
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_FORCE_SAMPLE_VDDR_DIS        0x00000000

// Field:   [4:0] TRIM_RECHARGE_COMP_OFFSET
//
// Trim offset of Recharge comparator.
//
// 0x00:  Maximum degeneration on input side (VDDR side).
// 0x1F:  Maximum degeneration on reference side from cap divider.
// 0x10: Nominal code.
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_W   \
                                                                             5
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_M   \
                                                                    0x0000001F
#define ADI_3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_S   \
                                                                             0


#endif // __ADI_3_REFSYS__
